vortigont/ESPIron-PTS200/SolderingPen_ESP32S2/main.cpp
  accellTemp = getAccellTemp();
  lastSENSORTmp = getAccellTemp();
  u8g2.initDisplay();
  u8g2.begin();
  u8g2.sendF("ca", 0xa8, 0x3f);
  u8g2.enableUTF8Print();
  if(hand_side){
    u8g2.setDisplayRotation(U8G2_R3);
  }else{
    u8g2.setDisplayRotation(U8G2_R1);
  }

  // initialize heater
  heater.init();
  // read and set saved iron temperature 读取和设置当前的烙铁头温度
  heater.setTargetTemp( DefaultTemp );
}

int SENSORCheckTimes = 0;
long lastMillis = 0;
long meas_cnt, meas_ms = 0;

void loop() {
  ++meas_cnt;
  if (millis() - meas_ms > 1000){
    LOGV(T_DBG, printf, "lps: %u\n", meas_cnt);
    meas_cnt = 0;
    meas_ms = millis();
  }

  long timems = millis();
  ROTARYCheck();  // check rotary encoder (temp/boost setting, enter setup menu)
                  // 检查旋转编码器(温度/升压设置，进入设置菜单)
  SLEEPCheck();  // check and activate/deactivate sleep modes
                 // 检查和激活/关闭睡眠模式

  if (SENSORCheckTimes > 1) {
    // long timems = millis();
    SENSORCheck();  // reads temperature and vibration switch of the iron
                    // 读取烙铁头的温度和振动开关
    // lastMillis = millis() - timems;
    // Serial.println(lastMillis);
    SENSORCheckTimes = 0;
  }
  SENSORCheckTimes++;

  if (timems - pidmillis > 100)
    Thermostat();  // heater control 加热器控制

  MainScreen();  // updates the main page on the OLED 刷新OLED主界面
  lastMillis = millis() - timems;
  //Serial.println(lastMillis);
}

// check rotary encoder; set temperature, toggle boost mode, enter setup menu
// accordingly 检查旋转编码器;设置温度，切换升压模式，进入设置菜单相应
void ROTARYCheck() {
  // set working temperature according to rotary encoder value
  // 根据旋转编码器值设定工作温度
  heater.setTargetTemp( getRotary() );

  uint8_t c = digitalRead(BUTTON_PIN);
  if (!c && c0) {
    delay(10);
    if (digitalRead(BUTTON_PIN) == c) {
      beep();
      buttonmillis = millis();
      delay(10);
      while ((!digitalRead(BUTTON_PIN)) && ((millis() - buttonmillis) < 500))
        ;
      delay(10);
      if ((millis() - buttonmillis) >= 500) {
        SetupScreen();
      } else {
        if (inLockMode) {
          inLockMode = false;
          heater.enable();
        } else {
          buttonmillis = millis();
          while ((digitalRead(BUTTON_PIN)) && ((millis() - buttonmillis) < 200))
            delay(10);
          if ((millis() - buttonmillis) >= 200) {  // single click
            if (inOffMode) {
              // enable heater
              inOffMode = false;
              heater.enable();
            } else {
              inBoostMode = !inBoostMode;
              if (inBoostMode) {
                boostmillis = millis();
              }
              handleMoved = true;
            }
          } else {  // double click
            // disable heater
            inOffMode = true;
            heater.disable();
          }
        }
      }
    }
  }
  c0 = c;

  // check timer when in boost mode 在升温模式时检查计时器
  if (inBoostMode && timeOfBoost) {
    goneSeconds = (millis() - boostmillis) / 1000;
    if (goneSeconds >= timeOfBoost) {
      inBoostMode = false;  // stop boost mode 停止升温模式
      beep();  // beep if boost mode is over 如果升温模式结束，会发出蜂鸣声
      beepIfWorky = true;  // beep again when working temperature is reached
                           // 当达到工作温度，会发出蜂鸣声
    }
  }
}

// check and activate/deactivate sleep modes 检查和激活/关闭睡眠模式
void SLEEPCheck() {
  if (inLockMode) 
    return;

    if (handleMoved) {  // if handle was moved 如果手柄被移动
      u8g2.setPowerSave(0);
      if (inSleepMode) {  // in sleep or off mode? 在睡眠模式还是关机模式?
        pwm_limit = POWER_LIMIT_20;
        if (VoltageValue < 3) {
          pwm_limit = POWER_LIMIT_15;
        }
        heater.enable();
        beep();              // beep on wake-up
        beepIfWorky = true;  // beep again when working temperature is reached
                             // 当达到工作温度，会发出蜂鸣声
      }
      handleMoved = false;  // reset handleMoved flag
      inSleepMode = false;  // reset sleep flag
      //      inOffMode = false;      // reset off flag
      sleepmillis = millis();  // reset sleep timer
    }

    // check time passed since the handle was moved 检查把手被移动后经过的时间
    goneSeconds = (millis() - sleepmillis) / 1000;
    if ((!inSleepMode) && (time2sleep > 0) && (goneSeconds >= time2sleep)) {
      inSleepMode = true;
      heater.setTargetTemp(SleepTemp);
      beep();
    } else if ((!inOffMode) && (time2off > 0) &&
               ((goneSeconds / 60) >= time2off)) {
      inOffMode = true;
      heater.disable();
      u8g2.setPowerSave(1);
      beep();
    }

}

// reads temperature, vibration switch and supply voltages
// 读取温度，振动开关和电源电压
void SENSORCheck() {
  /*#if defined(MPU)
    mpu6050.update();
    if (abs(mpu6050.getGyroX() - gx) > WAKEUP_THRESHOLD ||
    abs(mpu6050.getGyroY() - gy) > WAKEUP_THRESHOLD || abs(mpu6050.getGyroZ() -
    gz) > WAKEUP_THRESHOLD)
    {
      gx = mpu6050.getGyroX();
      gy = mpu6050.getGyroY();
      gz = mpu6050.getGyroZ();
      handleMoved = true;
      Serial.println("进入工作状态!");
    }*/
  // #if defined(LIS)

  // if (abs(accel.getX() - gx) > WAKEUPthreshold ||
  //     abs(accel.getY() - gy) > WAKEUPthreshold ||
  //     abs(accel.getZ() - gz) > WAKEUPthreshold) {
  //   gx = accel.getX();
  //   gy = accel.getY();
  //   gz = accel.getZ();
  //   handleMoved = true;
  //   //    Serial.println("进入工作状态!");
  // }

  // accel.getRawX() return int16_t

  if (accel.available()) {
    accels[accelIndex][0] = accel.getRawX() + 32768;
    accels[accelIndex][1] = accel.getRawY() + 32768;
    accels[accelIndex][2] = accel.getRawZ() + 32768;
    accelIndex++;

    // debug output
    // Serial.print("X: ");
    // Serial.print(accels[accelIndex][0]);
    // Serial.print(" Y: ");
    // Serial.print(accels[accelIndex][1]);
    // Serial.print(" Z: ");
    // Serial.println(accels[accelIndex][2]);

    if (accelIndex >= ACCEL_SAMPLES) {
      accelIndex = 0;
      // cal variance
      uint64_t avg[3] = {0, 0, 0};
      for (int i = 0; i < ACCEL_SAMPLES; i++) {
        avg[0] += accels[i][0];
        avg[1] += accels[i][1];
        avg[2] += accels[i][2];
      }
      avg[0] /= ACCEL_SAMPLES;
      avg[1] /= ACCEL_SAMPLES;
      avg[2] /= ACCEL_SAMPLES;
      uint64_t var[3] = {0, 0, 0};
      for (int i = 0; i < ACCEL_SAMPLES; i++) {
        var[0] += (accels[i][0] - avg[0]) * (accels[i][0] - avg[0]);
        var[1] += (accels[i][1] - avg[1]) * (accels[i][1] - avg[1]);
        var[2] += (accels[i][2] - avg[2]) * (accels[i][2] - avg[2]);
      }
      var[0] /= ACCEL_SAMPLES;
      var[1] /= ACCEL_SAMPLES;
      var[2] /= ACCEL_SAMPLES;
      // debug output
      // Serial.print("variance: ");
      // Serial.print(var[0]);
      // Serial.print(" ");
      // Serial.print(var[1]);
      // Serial.print(" ");
      // Serial.println(var[2]);

