vortigont/ESPIron-PTS200/SolderingPen_ESP32S2/main.cpp
// temperature calibration screen 温度校准屏幕
void CalibrationScreen() {
  uint16_t CalTempNew[4];
  uint16_t lastTargetTemp = heater.getTargetTemp();
  for (uint8_t CalStep = 0; CalStep < 3; CalStep++) {
    heater.setTargetTemp( CalTemp[CurrentTip][CalStep] );
    LOGI(T_CTRL, print, "Target Temp: ");
    LOGI(T_CTRL, println, heater.getTargetTemp());
    setRotary(100, 500, 1, heater.getTargetTemp());
    beepIfWorky = true;
    bool lastbutton = (!digitalRead(BUTTON_PIN));

    do {
      SENSORCheck();  // reads temperature and vibration switch of the iron
                      // 读取烙铁头的温度和振动开关
      Thermostat();   // heater control

      u8g2.firstPage();
      do {
        u8g2.setFont(PTS200_16);
            if(language == 2){
      u8g2.setFont(u8g2_font_unifont_t_chinese3);
    }
        u8g2.setFontPosTop();
        //        strcpy_P(F_Buffer, PSTR("校准"));
        u8g2.drawUTF8(0, 0 + SCREEN_OFFSET, txt_calibrate[language]);
        u8g2.setCursor(0, 16 + SCREEN_OFFSET);
        u8g2.print(txt_step[language]);
        u8g2.print(CalStep + 1);
        u8g2.print(" of 3");
        if (isWorky) {
          u8g2.setCursor(0, 32 + SCREEN_OFFSET);
          u8g2.print(txt_set_measured[language]);
          u8g2.setCursor(0, 48 + SCREEN_OFFSET);
          u8g2.print(txt_s_temp[language]);
          u8g2.print(getRotary());
        } else {
          u8g2.setCursor(0, 32 + SCREEN_OFFSET);
          u8g2.print(txt_temp_2[language]);
          u8g2.print(heater.getCurrentTemp());
          u8g2.setCursor(0, 48 + SCREEN_OFFSET);
          u8g2.print(txt_wait_pls[language]);
        }
      } while (u8g2.nextPage());
      if (lastbutton && digitalRead(BUTTON_PIN)) {
        delay(10);
        lastbutton = false;
      }
    } while (digitalRead(BUTTON_PIN) || lastbutton);

    CalTempNew[CalStep] = getRotary();
    beep();
    delay(10);
  }

  heater.disable();  // shut off heater 关闭加热器
  if (VoltageValue == 3) {
    delayMicroseconds(TIME2SETTLE_20V);
  } else {
    delayMicroseconds(TIME2SETTLE);  // wait for voltage to settle 等待电压稳定
  }
  CalTempNew[3] = getAccellTemp();  // read chip temperature 读芯片温度
  if ((CalTempNew[0] + 10 < CalTempNew[1]) &&
      (CalTempNew[1] + 10 < CalTempNew[2])) {
    if (MenuScreen(StoreItems, sizeof(StoreItems), 0)) {
      for (uint8_t i = 0; i < 4; i++) CalTemp[CurrentTip][i] = CalTempNew[i];
    }
  }

  heater.setTargetTemp( lastTargetTemp );
  update_EEPROM();
}

// input tip name screen 输入烙铁头名字屏幕
void InputNameScreen() {
  uint8_t value;

  for (uint8_t digit = 0; digit < (TIPNAMELENGTH - 1); digit++) {
    bool lastbutton = (!digitalRead(BUTTON_PIN));
    setRotary(31, 96, 1, 65);
    do {
      value = getRotary();
      if (value == 31) {
        value = 95;
        setRotary(31, 96, 1, 95);
      }
      if (value == 96) {
        value = 32;
        setRotary(31, 96, 1, 32);
      }
      u8g2.firstPage();
      do {
        u8g2.setFont(PTS200_16);
            if(language == 2){
      u8g2.setFont(u8g2_font_unifont_t_chinese3);
    }
        u8g2.setFontPosTop();
        u8g2.drawUTF8(0, 0 + SCREEN_OFFSET, txt_enter_tip_name[language]);
        u8g2.setCursor(12 * digit, 48 + SCREEN_OFFSET);
        u8g2.print(char(94));
        u8g2.setCursor(0, 32 + SCREEN_OFFSET);
        for (uint8_t i = 0; i < digit; i++) u8g2.print(TipName[CurrentTip][i]);
        u8g2.setCursor(12 * digit, 32 + SCREEN_OFFSET);
        u8g2.print(char(value));
      } while (u8g2.nextPage());
      if (lastbutton && digitalRead(BUTTON_PIN)) {
        delay(10);
        lastbutton = false;
      }
    } while (digitalRead(BUTTON_PIN) || lastbutton);
    TipName[CurrentTip][digit] = value;
    beep();
    delay(10);
  }
  TipName[CurrentTip][TIPNAMELENGTH - 1] = 0;
  return;
}

// delete tip screen 删除烙铁头屏幕
void DeleteTipScreen() {
  if (NumberOfTips == 1) {
    MessageScreen(DeleteMessage, sizeof(DeleteMessage));
  } else if (MenuScreen(SureItems, sizeof(SureItems), 0)) {
    if (CurrentTip == (NumberOfTips - 1)) {
      CurrentTip--;
    } else {
      for (uint8_t i = CurrentTip; i < (NumberOfTips - 1); i++) {
        for (uint8_t j = 0; j < TIPNAMELENGTH; j++)
          TipName[i][j] = TipName[i + 1][j];
        for (uint8_t j = 0; j < 4; j++) CalTemp[i][j] = CalTemp[i + 1][j];
      }
    }
    NumberOfTips--;
  }
}

// add new tip screen 添加新的烙铁头屏幕
void AddTipScreen() {
  if (NumberOfTips < TIPMAX) {
    CurrentTip = NumberOfTips++;
    InputNameScreen();
    CalTemp[CurrentTip][0] = TEMP200;
    CalTemp[CurrentTip][1] = TEMP280;
    CalTemp[CurrentTip][2] = TEMP360;
    CalTemp[CurrentTip][3] = TEMPCHP;
  } else
    MessageScreen(MaxTipMessage, sizeof(MaxTipMessage));
}

// get LIS/MPU temperature 获取LIS/MPU的温度
float getAccellTemp() {
#if defined(MPU)
  mpu6050.update();
  return mpu6050.getTemp();
#elif defined(LIS)
  return accel.getTemperature();
#endif
}

// get supply voltage in mV 得到以mV为单位的电源电压
uint16_t getVIN() {
  long value;
  long voltage;
  long result = 0;

  for (uint8_t i = 0; i < 4; i++) {  // get 32 readings 得到32个读数
    //    long val = analogRead(VIN_PIN);
    long val = adc_vin.readMiliVolts();

    result += val;  // add them up 把它们加起来
  }

  value = (result / 4);

  //  // VIN_Ru = 100k, Rd_GND = 3.3K
  //  if (value < 500)
  //  {
  //    voltage = value * 1390 * 31.3 / 4095 * 1.35;
  //  }
  //  else if (500 <= value && value < 1000)
  //  {
  //    voltage = value * 1390 * 31.3 / 4095 * 1.135;
  //  }
  //  else if (1000 <= value && value < 1500)
  //  {
  //    voltage = value * 1390 * 31.3 / 4095 * 1.071;
  //  }
  //  else if (1500 <= value && value < 2000)
  //  {
  //    voltage = value * 1390 * 31.3 / 4095;
  //  }
  //  else if (2000 <= value && value < 3000)
  //  {
  //    voltage = value * 1390 * 31.3 / 4095;
  //  }
  //  else
  //    voltage = value * 1390 * 31.3 / 4095;

  voltage = value * 31.3;

  return voltage;
  // return value;
}

int32_t variance(int16_t a[]) {
  // Compute mean (average of elements)计算平均值(元素的平均值)
  int32_t sum = 0;

  for (int i = 0; i < 32; i++) sum += a[i];
  int16_t mean = (int32_t)sum / 32;
  // Compute sum squared differences with mean.计算和平方差的平均值
  int32_t sqDiff = 0;
  for (int i = 0; i < 32; i++) sqDiff += (a[i] - mean) * (a[i] - mean);
  return (int32_t)sqDiff / 32;
}

unsigned int Button_Time1 = 0, Button_Time2 = 0;

